In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("phone_data.csv")

In [4]:
df.head(20)

    index            date  duration  item    month    network network_type
0       0  15/10/14 06:58    34.429  data  2014-11       data         data
1       1  15/10/14 06:58    13.000  call  2014-11   Vodafone       mobile
2       2  15/10/14 14:46    23.000  call  2014-11     Meteor       mobile
3       3  15/10/14 14:48     4.000  call  2014-11      Tesco       mobile
4       4  15/10/14 17:27     4.000  call  2014-11      Tesco       mobile
5       5  15/10/14 18:55     4.000  call  2014-11      Tesco       mobile
6       6  16/10/14 06:58    34.429  data  2014-11       data         data
7       7  16/10/14 15:01   602.000  call  2014-11      Three       mobile
8       8  16/10/14 15:12  1050.000  call  2014-11      Three       mobile
9       9  16/10/14 15:30    19.000  call  2014-11  voicemail    voicemail
10     10  16/10/14 16:21  1183.000  call  2014-11      Three       mobile
11     11  16/10/14 22:18     1.000   sms  2014-11     Meteor       mobile
12     12  16/10/14 22:21     1.000   sms  2014-11     Meteor       mobile
13     13  17/10/14 06:58    34.429  data  2014-11       data         data
14     14  17/10/14 10:53     1.000   sms  2014-11      Tesco       mobile
15     15  17/10/14 11:19     1.000   sms  2014-11      Tesco       mobile
16     16  17/10/14 11:20     1.000   sms  2014-11     Meteor       mobile
17     17  17/10/14 17:22     1.000   sms  2014-11   Vodafone       mobile
18     18  17/10/14 17:23     1.000   sms  2014-11   Vodafone       mobile
19     19  17/10/14 17:26    92.000  call  2014-11      Three       mobile

In [5]:
df.shape

(830, 7)

In [6]:
len(df)

830

In [7]:
df.count()

index           830
date            830
duration        830
item            830
month           830
network         830
network_type    830
dtype: int64

In [13]:
df[df["item"]=="call"]['duration'].max()

10528.0

In [14]:
df[df['item']=='call']['duration'].sum()

92321.0

In [34]:
ab=df['month'].unique()
ab

array(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'],
      dtype=object)

In [33]:
for i in range(len(ab)):
    print(ab[i])
    print(df[df['month']==ab[i]]["month"].count())

2014-11
230
2014-12
157
2015-01
205
2015-02
137
2015-03
101

In [39]:
df['network'].nunique()

9

In [36]:
df['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [40]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [42]:
gb=df.groupby("month")

In [50]:
gb.first()

         index             date  duration  item   network network_type
month
2014-11      0   15/10/14 06:58    34.429  data      data         data
2014-12    228   13/11/14 06:58    34.429  data      data         data
2015-01    381   13/12/14 06:58    34.429  data      data         data
2015-02    577   13/01/15 06:58    34.429  data      data         data
2015-03    729  12/2/2015 20:15    69.000  call  landline     landline

In [54]:
gb.get_group("2014-11").head()

   index            date  duration  item   network network_type
0      0  15/10/14 06:58    34.429  data      data         data
1      1  15/10/14 06:58    13.000  call  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call    Meteor       mobile
3      3  15/10/14 14:48     4.000  call     Tesco       mobile
4      4  15/10/14 17:27     4.000  call     Tesco       mobile

In [56]:
gb.sum()

          index   duration
month
2014-11   26337  26639.441
2014-12   48362  14641.870
2015-01  100259  18223.299
2015-02   90398  15522.299
2015-03   78679  22750.441

In [78]:
gb.count()
len(gb.get_group("2014-11"))

230

In [79]:
gb.count()

         index  date  duration  item  network  network_type
month
2014-11    230   230       230   230      230           230
2014-12    157   157       157   157      157           157
2015-01    205   205       205   205      205           205
2015-02    137   137       137   137      137           137
2015-03    101   101       101   101      101           101

In [81]:
gb['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [71]:
##. What is the sum of durations, for calls only, to each network?

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [101]:
df1=df[df["item"]=='call']
gb=df.groupby("network")

In [103]:
gb['duration'].sum()

network
Meteor        7233.00
Tesco        13841.00
Three        36551.00
Vodafone     14770.00
data          5164.35
landline     18433.00
special          3.00
voicemail     1775.00
world            7.00
Name: duration, dtype: float64